Repository: mlforcada/llibre-tecnol-trad
Catalog: llibrett/omegat/tm/memr.tmx
Source language: ca
Languages: es

source: {Com més profunda és l'anàlisi del text origen, més senzilla és (menys esforç comporta) la transferència a la representació corresponent de la llengua meta i més complexa la generació.
es: {Cuanto más profundo es el análisis del texto origen, más sencilla es (menos esfuerzo comporta) la transferencia a la representación correspondiente de la lengua meta y más compleja la generación.

source: {Fase de transferència d'un sistema senzill de transferència morfològica avançada, amb regles de reordenament i de concordança}
es: {Fase de transferencia de un sistema sencillo de transferencia morfológica avanzada, con reglas de reordenamiento y de concordancia}

source: {Freqüències d'aparició de parells de mots sobre economia.}
es: {Frecuencias de aparición de pares de palabras sobre economía.}

source: {Minimització dels transductors de lletres:} La definició general dels transductors de lletres és completament paral·lela a la dels autòmats finits no deterministes (AFND) i la dels transductors de lletres deterministes, a la dels automats finits deterministes (AFD).
es: {Minimización de los transductores de letras:} La definición general de los transductores de letras es completamente paralela a la de los autómatas finitos no deterministas (AFND) y la de los transductores de letras deterministas, a la de los autómatas finitos deterministas (AFD).

source: {Sistemes de transferència morfològica}
es: {Sistemas de transferencia morfológica}

source: {Sistemes de transferència semàntica}
es: {Sistemas de transferencia semántica}

source: {Sistemes de transferència sintàctica}
es: {Sistemas de transferencia sintáctica}

source: {Taula d'anàlisi sintàctica per a les oracions senzilles descrites per la gramàtica de la p. .
es: {Tabla de análisis sintáctico para las oraciones sencillas descritas por la gramática de la p. .

source: {Transductors de lletres:} La construcció d'un analitzador morfològic d'aquesta classe és molt senzilla a partir d'expressions que expressen les relacions d'alineament entre les formes superficials i les lèxiques; a més, es pot relaxar la restricció que el transductor siga determinista, per tal que durant l'anàlisi d'una forma superficial es puga considerar més d'una forma lèxica possible.
es: {Transductores de letras:} La construcción de un analizador morfológico de esta clase es muy sencilla a partir de expresiones que expresan las relaciones de alineamiento entre las formas superficiales y las léxicas; además, se puede relajar la restricción que el transductor sea determinista, para que durante el análisis de una forma superficial se pueda considerar más de una forma léxica posible.

source: {Va adquirir} el navegant de Zkannag el-OBJ control-OBJ TA: El navegant de Zkannag va adquirir el control (correcta).
es: {Adquirió} el navegante de Zkannag el-OBJ control-OBJ TA: El navegante de Zkannag adquirió el control (correcta).

source: {Va adquirir} el navegant el-OBJ control-OBJ TA: El navegant va adquirir el control (correcta).
es: {Adquirió} el navegante el-OBJ control-OBJ TA: El navegante adquirió el control (correcta).

source: {Va adquirir} el navegant estelar de Zkannag el-OBJ control-OBJ TA: *El navegant estelar va adquirir de Zkannag el control.
es: {Adquirió} el navegante estelar de Zkannag el-OBJ control-OBJ TA: El navegante estelar adquirió de Zkannag el control.

source: {Va adquirir} el navegant estelar el-OBJ control-OBJ TA: El navegant estelar va adquirir el control (correcta).
es: {Adquirió} el navegante estelar el-OBJ control-OBJ TA: El navegante estelar adquirió el control (correcta).

source: } } } {Fases d'anàlisi, transferència i generació en un sistema de traducció indirecta per transferència.} L'arquitectura de transferència és el model estàndard per a la traducció automàtica contemporània, i ho ha estat per molts anys {arnold93j}.
es: } } } {Fases de análisis, transferencia y generación en un sistema de traducción indirecta por transferencia.} La arquitectura de transferencia es el modelo estándar para la traducción automática contemporánea, y lo ha sido por muchos años {arnold93j}.

source: } } } } } } {Cost d'afegir una quarta llengua $L_4$ a un sistema d'interlingua.}
es: } } } } } } {Coste de añadir una cuarta llengua $L_4$ a un sistema de interlingua.}

source: } } } } } } } } } } } } $}} $}} $}} $}} $}} $}} } {Cost d'afegir una quarta llengua $L_4$ a un sistema de transferència.
es: } } } } } } } } } } } } $}} $}} $}} $}} $}} $}} } {Coste de añadir una cuarta lengua $L_4$ a un sistema de transferencia.

source: És a dir, d'una banda, la traducció automàtica real és el resultat d'aproximacions successives sobre la traducció automàtica ideal: La majoria dels sistemes de TA adopten l'aproximació segons la qual traduir texts és traduir oracions, la qual, per exemple, exclou el tractament d'alguns aspectes de l'estructura del discurs.
es: Es decir, por un lado, la traducción automática real es el resultado de aproximaciones sucesivas sobre la traducción automática ideal: La mayoría de los sistemas de TA adoptan la aproximación según la cual traducir textos es traducir oraciones, la cual, por ejemplo, excluye el tratamiento de algunos aspectos de la estructura del discurso.

source: És a dir, el transductor es pot trobar en més d'un estat per al mateix prefix del mot d'entrada i pot estar considerant diverses transduccions alternatives, algunes de les quals pot abandonar quan haja llegit un prefix més llarg del mot d'entrada.
es: Es decir, el transductor se puede encontrar en más de un estado para el mismo prefijo de la palabra de entrada y puede estar considerando diversas transducciones alternativas, algunas de las cuales puede abandonar cuando haya leído un prefijo más largo de la palabra de entrada.

source: És a dir, es fa una anàlisi morfològica i una anàlisi sintàctica (anglés parsing) de la frase en LO.
es: Es decir, se hace un análisis morfológico y un análisis sintáctico (inglés parsing) de la frase en LO.

source: És a dir, llig les oracions mot a mot d'esquerra a dreta i fa l'anàlisi morfològica de cada mot, prova de detectar la seqüència més llarga de mots que concorda amb alguna seqüència de categories lèxiques que té en el seu catàleg, processa la seqüència, i continua immediatament després de la seqüència processada.
es: Es decir, lee las oraciones palabra por palabra de izquierda a derecha y hace el análisis morfológico de cada palabra, prueba de detectar la secuencia más larga de palabras que concuerda con alguna secuencia de categorías léxicas que tiene en su catálogo, procesa la secuencia, y continúa inmediatamente después de la secuencia procesada.

source: És a dir, sense construir l'arbre complet.
es: Es decir, sin construir el árbol completo.
